# Задайте список из N элементов, заполненных числами из промежутка [-N, N].
# Найдите произведение элементов на указанных пользователем через пробел позициях.

N = int(input('Введите число: '))
spam= list(range(-N,N+1))
print(spam)
